simpleFoam_kOmagaSST/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 22.4;

boundaryField
{
    topPatch
    {
        type            zeroGradient;
    }
    wall
    {
        type            omegaWallFunction;
        value           uniform 22.4;
    }
    bottomPatch
    {
       type            turbulentMixingLengthFrequencyInlet;
        mixingLength    7e-4;
       value           $internalField;

    }
}


// ************************************************************************* //
