simpleFoam_kOmagaSST/Allrun-semiParallel
./Allclean

#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

restore0Dir
runApplication blockMesh
runApplication snappyHexMesh -overwrite
runApplication topoSet
runApplication createPatch -overwrite
touch snappy_parallel.foam

#Step-1 now we will decompose parallel
runApplication decomposePar
#Step 2 now we run our solver in parallel  
runParallel pimpleFoam

#Step 3 now we need to reconstruct 
runApplication reconstructPar


